# **[2] ì •í˜• ë°ì´í„° í™œìš©**

**[í•™ìŠµ ëª©í‘œ]**
1. ì •í˜• ë°ì´í„°ì˜ í˜•íƒœì™€ íŠ¹ì§•ì— ëŒ€í•´ ì´í•´í•  ìˆ˜ ìˆë‹¤.  
2. ì •í˜• ë°ì´í„°ì˜ êµ¬ì¡°ë¥¼ ì‚´í´ë³´ê³  í™œìš©í•˜ê¸° ì‰½ê²Œ ì „ì²˜ë¦¬í•  ìˆ˜ ìˆë‹¤.

## **1. ì •í˜• ë°ì´í„°**

**ì •í˜• ë°ì´í„°**ëŠ” ë¯¸ë¦¬ ì •í•´ ë†“ì€ í˜•ì‹ê³¼ êµ¬ì¡°ì— ë”°ë¼ ì €ì¥ë˜ë„ë¡ êµ¬ì„±ëœ ë°ì´í„°ì—ìš”.  
> í‘œ í˜•íƒœë¡œ ë‚˜íƒ€ë‚¸ ê²ƒì´ ì •í˜• ë°ì´í„°ë¡œ, ì˜ìƒì´ë‚˜ ì–¸ì–´ ë“±ì˜ ë¹„ì •í˜• ë°ì´í„°ì™€ ë‹¤ë¥¸ êµ¬ì¡°ì—ìš”.  

ì •í˜• ë°ì´í„°ê°€ ê°€ì§€ëŠ” íŠ¹ì§•ì´ ë¬´ì—‡ì¸ì§€, ì–´ë–»ê²Œ í™œìš©í•  ìˆ˜ ìˆì„ì§€ ì•Œì•„ë³´ì•„ìš”.

<table>
<tr>
    <th><img src="https://drive.google.com/uc?id=1erYoZeEp-xJNAq70xSyqbWXq-F7NX_WS" width="750"></th>
    </tr>
<tr>
    <th>ì •í˜• ë°ì´í„°ì™€ ë¹„ì •í˜• ë°ì´í„°</th>
</tr>
</table>

### **(1) ì •í˜• ë°ì´í„°ì˜ íŠ¹ì§•**

ì •í˜• ë°ì´í„°ëŠ” í‘œì™€ ê°™ì´ ëª…í™•í•œ êµ¬ì¡°ë¥¼ ê°€ì§€ê³  ìˆì–´ì„œ ì—¬ëŸ¬ ì¥ì ì„ ê°€ì§€ê³  ìˆì–´ìš”.
* í–‰ê³¼ ì—´ë¡œ ëª¨ë“  ë°ì´í„°ë¥¼ í‘œí˜„í•  ìˆ˜ ìˆì–´, **ì»´í“¨í„°ê°€ ì ‘ê·¼**í•˜ê¸° ì‰¬ì›Œìš”.
* ê° ì—´ë§ˆë‹¤ **ê³µí†µëœ ì†ì„±**(**ìˆ«ì, ë¬¸ìì—´, ë‚ ì§œ ë“±**)ì„ ê°€ì§€ê¸° ë•Œë¬¸ì— í•„ìš”í•œ íŠ¹ì§•ì„ ë¶„ì„í•˜ê¸° ì‰¬ì›Œìš”.
* ë°ì´í„°ê°€ ì²´ê³„ì ìœ¼ë¡œ ì €ì¥ë˜ì–´ì„œ **ì €ì¥ ê³µê°„**ì´ ë§ì´ í•„ìš”í•˜ì§€ ì•Šì•„ìš”. 
* ë°ì´í„°ë¥¼ ìˆ˜ì§‘í•˜ê±°ë‚˜ ìˆ˜ì •í•˜ëŠ” ë“± **ê´€ë¦¬í•˜ê¸° í¸ë¦¬**í•´ìš”.

<table>
<tr>
    <th><img src="https://drive.google.com/uc?id=1_ssRx4p6yeXVXn0vYbDf9Tx6Z7dSoRYA" width="750"></th>
    </tr>
<tr>
    <th>ì •í˜• ë°ì´í„°ì˜ íŠ¹ì§•</th>
</tr>
</table>

### **(2) ì •í˜• ë°ì´í„° ìˆ˜ì§‘**

ì¸ê³µì§€ëŠ¥ í•™ìŠµì— ì‚¬ìš©í•˜ëŠ” ì •í˜• ë°ì´í„°ë¥¼ ì œê³µí•˜ëŠ” ì—¬ëŸ¬ ì‚¬ì´íŠ¸ê°€ ìˆì–´ìš”.  
ì—¬ê¸°ì„œëŠ” ëŒ€í‘œì ìœ¼ë¡œ ë‘ ê°€ì§€ ì˜ˆì‹œë¥¼ ì†Œê°œí• ê²Œìš”.   
* ê³µê³µ ë°ì´í„° í¬í„¸(https://www.data.go.kr/): ë‹¤ì–‘í•œ ë¶„ì•¼ì˜ ë°ì´í„°ê°€ ìˆì§€ë§Œ, ë•Œë•Œë¡œ ê°’ì´ ê³ ë¥´ì§€ ëª»í•´ ì „ì²˜ë¦¬ ê³¼ì •ì´ í•„ìš”í•˜ê¸°ë„ í•´ìš”.
* ìºê¸€(https://www.kaggle.com/): ì£¼ì–´ì§„ ë°ì´í„°ë¡œ ê³¼ì œë¥¼ í•´ê²°í•˜ê¸° ìœ„í•œ ëŒ€íšŒ í”Œë«í¼ì´ì—ìš”. ëŒ€íšŒë¥¼ ìœ„í•œ ë°ì´í„°ë¥¼ ì œê³µí•˜ê¸° ë•Œë¬¸ì— ì–´ëŠ ì •ë„ ì „ì²˜ë¦¬ê°€ ë˜ì–´ ìˆì–´ìš”.

### **(3) ì •í˜• ë°ì´í„°ì˜ í˜•íƒœ**

ì •í˜• ë°ì´í„°ì˜ í˜•íƒœëŠ” CSV(Comma Separated Values), ê´€ê³„í˜• ë°ì´í„°ë² ì´ìŠ¤, ìŠ¤í”„ë ˆë“œì‹œíŠ¸ ë“± ì—¬ëŸ¬ ê°€ì§€ê°€ ìˆì–´ìš”.  
ëŒ€í‘œì ì¸ ì˜ˆì‹œì¸ CSVëŠ”, ì•„ë˜ì™€ ê°™ì´ ê° ë°ì´í„° ê°’ì„ ì‰¼í‘œë¡œ êµ¬ë¶„í•˜ëŠ” í˜•íƒœì…ë‹ˆë‹¤.

<table>
<tr>
    <th><img src="https://drive.google.com/uc?id=1egLfmC_ndWAx89UXwyl8yyogsD_Lk-qx" width="750"></th>
    </tr>
<tr>
    <th>CSV íŒŒì¼ì˜ í˜•íƒœ</th>
</tr>
</table>

## **2. ë°ì´í„° ì „ì²˜ë¦¬**

ì¸ê³µì§€ëŠ¥ì„ ì¢‹ì€ ë°©ë²•ìœ¼ë¡œ í•™ìŠµí•˜ëŠ” ê²ƒë§Œí¼ ì˜¬ë°”ë¥¸ ë°ì´í„°ë¥¼ ì‚¬ìš©í•˜ëŠ” ê²ƒë„ ì¤‘ìš”í•´ìš”.  
ì›í•˜ëŠ” ì„±ëŠ¥ìœ¼ë¡œ ì¸ê³µì§€ëŠ¥ì„ í•™ìŠµì‹œí‚¤ë ¤ë©´, ìˆ˜ì§‘í•œ ë°ì´í„°ë¥¼ ì „ì²˜ë¦¬í•˜ì—¬ ë°ì´í„°ì˜ í’ˆì§ˆì„ ë†’ì—¬ì•¼ í•´ìš”.  
pandasë¥¼ ì‚¬ìš©í•˜ì—¬, ì •í˜• ë°ì´í„°ì— ëŒ€í•´ ì „ì²˜ë¦¬í•˜ëŠ” ê³¼ì •ì„ ë°°ì›Œë´ìš”.

### **(1) pandas ë¼ì´ë¸ŒëŸ¬ë¦¬**

pandasëŠ” ë°ì´í„°ë¥¼ ë¶„ì„í•˜ê¸° ìœ„í•œ python ë¼ì´ë¸ŒëŸ¬ë¦¬ì—ìš”.  
pandasë¥¼ í™œìš©í•˜ì—¬, pythonìœ¼ë¡œ ì—‘ì…€ì„ ë‹¤ë£¨ë“¯ì´ ë°ì´í„° êµ¬ì¡°ë¥¼ ë§Œë“¤ê³  ë‹¤ë£° ìˆ˜ ìˆì–´ìš”.  

* pythonë§Œìœ¼ë¡œ ë°ì´í„°ë¥¼ ë¶„ì„í•  ë•Œë³´ë‹¤ ì†ë„ê°€ ë¹¨ë¼ìš”.
* ëˆ„ë½ëœ ë°ì´í„°ë¥¼ ì²˜ë¦¬í•˜ê¸° ìš©ì´í•´ìš”.
* ë°ì´í„° êµ¬ì¡°ì— ìˆ˜ì •, ì‚½ì… ë“± ë³€í˜•ì´ ììœ ë¡œì›Œìš”.

### **(2) ë°ì´í„° ì „ì²˜ë¦¬ ì‹¤ìŠµí•˜ê¸°**

pandasë¥¼ ì‚¬ìš©í•˜ì—¬ ì‹¤ì œë¡œ ì •í˜• ë°ì´í„°ë¥¼ ê°™ì´ í™•ì¸í•´ë³´ê³  ëˆ„ë½ëœ ë°ì´í„°ë¥¼ ì „ì²˜ë¦¬í•´ìš”.  
1912ë…„ íƒ€ì´íƒ€ë‹‰í˜¸ ì¹¨ëª° ì‚¬ê³ ì˜ ì‹¤ì œ ë°ì´í„°ë¥¼ í™œìš©í•˜ì—¬, ì–´ë–¤ ì •ë³´ê°€ ìˆëŠ”ì§€ ì‚´í´ë´ìš”.

In [15]:
import pandas as pd
titanic = pd.read_csv("titanic.csv")

In [16]:
print('titanic ë°ì´í„° í”„ë ˆì„ì˜ í¬ê¸°:', titanic.shape)
print('*************************')
print('titanic ë°ì´í„° í”„ë ˆì„ì˜ ì •ë³´:')
print(titanic.info( ))

titanic ë°ì´í„° í”„ë ˆì„ì˜ í¬ê¸°: (891, 12)
*************************
titanic ë°ì´í„° í”„ë ˆì„ì˜ ì •ë³´:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None

In [17]:
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [18]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [19]:
print('*** titanic ë°ì´í„° í”„ë ˆì„ì˜ ì†ì„± ì´ë¦„ ***')
print(titanic.columns)
print('*** titanic ë°ì´í„° í”„ë ˆì„ì˜ ì¸ë±ìŠ¤ ì •ë³´ ***')
print(titanic.index)

*** titanic ë°ì´í„° í”„ë ˆì„ì˜ ì†ì„± ì´ë¦„ ***
Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')
*** titanic ë°ì´í„° í”„ë ˆì„ì˜ ì¸ë±ìŠ¤ ì •ë³´ ***
RangeIndex(start=0, stop=891, step=1)

In [20]:
print('titanic ë°ì´í„° í”„ë ˆì„ì˜ ì†ì„±ë³„ ê³ ìœ í•œ ë°ì´í„°ì˜ ê°œìˆ˜')
titanic.nunique( )

titanic ë°ì´í„° í”„ë ˆì„ì˜ ì†ì„±ë³„ ê³ ìœ í•œ ë°ì´í„°ì˜ ê°œìˆ˜

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

In [21]:
titanic['Survived'].unique( )
titanic['Sex'].unique( )
titanic['Pclass'].unique( )
titanic['Embarked'].unique( )

array(['S', 'C', 'Q', nan], dtype=object)

In [22]:
# ê²°ì¸¡ì¹˜ í™•ì¸
titanic.isnull( ).sum( )

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [28]:
titanic[["Age", "Cabin", "Embarked"]].head(10)

         Age Cabin Embarked
0  22.000000   NaN        S
1  38.000000   C85        C
2  26.000000   NaN        S
3  35.000000  C123        S
4  35.000000   NaN        S
5  29.699118   NaN        Q
6  54.000000   E46        S
7   2.000000   NaN        S
8  27.000000   NaN        S
9  14.000000   NaN        C

In [23]:
titanic['Age'] = titanic['Age'].fillna(titanic['Age'].mean( ))

In [30]:
titanic.groupby('Embarked')['PassengerId'].count( )

Embarked
C    168
Q     77
S    646
Name: PassengerId, dtype: int64

In [31]:
titanic['Embarked'] = titanic['Embarked'].fillna('S')

In [25]:
# ê²°ì¸¡ì¹˜ í™•ì¸
titanic.isnull( ).sum( )

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

In [26]:
titanic.to_csv('titanic_preprocess.csv')

**[ë¬¸ì œ1] ì•„ë˜ ë°ì´í„°ì…‹ì˜ ê²°ì¸¡ì¹˜ë¥¼ í•´ê²°í•´ë³´ì•„ìš”.**   
x1ì€ í‰ê· ìœ¼ë¡œ, x2ëŠ” ì¤‘ì•™ê°’ìœ¼ë¡œ, x3ëŠ” ìµœë¹ˆê°’ìœ¼ë¡œ ê°’ì„ ì±„ì›Œì£¼ì„¸ìš”!

In [19]:
from io import StringIO
import pandas as pd

csv_data = StringIO("""
x1,x2,x3
1,0.1,1
2,,
3,,3
,0.4,5
5,0.5,5
,,
7,0.7,5
8,0.8,7
9,0.9,
""")

df = pd.read_csv(csv_data, dtype={"x1": pd.Int64Dtype()}, parse_dates=[2])
df

C:\Users\noheat\AppData\Local\Temp\ipykernel_18384\2473225807.py:17: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df = pd.read_csv(csv_data, dtype={"x1": pd.Int64Dtype()}, parse_dates=[2])

     x1   x2   x3
0     1  0.1    1
1     2  NaN  NaN
2     3  NaN    3
3  <NA>  0.4    5
4     5  0.5    5
5  <NA>  NaN  NaN
6     7  0.7    5
7     8  0.8    7
8     9  0.9  NaN

In [28]:
df['x1'] = df['x1'].fillna(df['x1'].mean( ))
df['x2'] = df['x2'].fillna(df['x2'].median( ))
df['x3'] = df['x3'].fillna(df['x3'].mode( )[0])
df

   x1   x2 x3
0   1  0.1  1
1   2  0.6  5
2   3  0.6  3
3   5  0.4  5
4   5  0.5  5
5   5  0.6  5
6   7  0.7  5
7   8  0.8  7
8   9  0.9  5

 ğŸ‘‰ 
 ğŸ‘‰